{"1": 0, "2": 1, "3": 2, "4": 3, "5": 4, "6": 5, "7": 6, "8": 7, "9": 8, "10": 9, "11": 10, "12": 11, "13": 12, "14": 13, "15": 14, "16": 15, "17": 16, "18": 17, "19": 18, "20": 19, "21": 20, "22": 21, "23": 22, "24": 23, "25": 24, "26": 25, "27": 26, "28": 27, "29": 28, "30": 29, "31": 30, "32": 31, "33": 32, "34": 33, "35": 34, "36": 35, "38": 36, "39": 37, "40": 38, "42": 39, "43": 40, "45": 41, "46": 42, "47": 43, "48": 44, "49": 45, "50": 46, "51": 47, "52": 48, "53": 49, "54": 50, "55": 51, "56": 52, "57": 53, "58": 54, "59": 55, "60": 56, "62": 57, "63": 58, "64": 59, "65": 60, "66": 61, "67": 62, "68": 63, "69": 64, "70": 65, "71": 66, "72": 67, "73": 68, "74": 69, "77": 70, "78": 71, "79": 72, "80": 73, "81": 74, "82": 75, "83": 76, "84": 77, "85": 78, "87": 79, "88": 80, "89": 81, "90": 82, "91": 83, "92": 84, "93": 85, "94": 86, "95": 87, "96": 88, "97": 89, "98": 90, "99": 91, "100": 92, "101": 93, "102": 94, "103": 95, "104": 96, "105": 97, "106": 98, "107": 99, "108": 100, "109": 101, "110": 102, "112": 103, "113": 104, "114": 105, "115": 106, "116": 107, "117": 108, "118": 109, "120": 110, "121": 111, "122": 112, "123": 113, "124": 114, "125": 115, "126": 116, "127": 117, "128": 118, "129": 119, "130": 120, "131": 121, "132": 122, "133": 123, "134": 124, "135": 125, "136": 126, "137": 127, "138": 128, "139": 129, "140": 130, "141": 131, "142": 132, "143": 133, "144": 134, "145": 135, "146": 136, "147": 137, "148": 138, "149": 139, "150": 140, "151": 141, "152": 142, "153": 143, "154": 144, "155": 145, "156": 146, "157": 147, "158": 148, "159": 149, "160": 150, "161": 151, "162": 152, "163": 153, "164": 154, "165": 155, "166": 156, "167": 157, "168": 158, "169": 159, "170": 160, "171": 161, "172": 162, "174": 163, "175": 164, "176": 165, "177": 166, "178": 167, "179": 168, "180": 169, "181": 170, "182": 171, "183": 172, "184": 173, "185": 174, "186": 175, "187": 176, "188": 177, "189": 178, "190": 179, "191": 180, "192": 181, "193": 182, "194": 183, "195": 184, "196": 185, "197": 186, "198": 187, "199": 188, "200": 189, "201": 190, "202": 191, "203": 192, "204": 193, "205": 194, "206": 195, "207": 196, "208": 197, "209": 198, "210": 199, "211": 200, "212": 201, "213": 202, "214": 203, "215": 204, "216": 205, "217": 206, "218": 207, "219": 208, "220": 209, "222": 210, "223": 211, "224": 212, "225": 213, "226": 214, "227": 215, "228": 216, "229": 217, "230": 218, "231": 219, "232": 220, "233": 221, "235": 222, "236": 223, "237": 224, "238": 225, "239": 226, "240": 227, "241": 228, "242": 229, "243": 230, "244": 231, "245": 232, "246": 233, "247": 234, "248": 235, "249": 236, "250": 237, "251": 238, "252": 239, "253": 240, "254": 241, "255": 242, "256": 243, "258": 244, "259": 245, "260": 246, "261": 247, "262": 248, "263": 249, "264": 250, "265": 251, "266": 252, "267": 253, "268": 254, "269": 255, "270": 256, "271": 257, "272": 258, "274": 259, "275": 260, "276": 261, "277": 262, "278": 263, "279": 264, "280": 265, "281": 266, "282": 267, "283": 268, "284": 269, "285": 270, "286": 271, "287": 272, "288": 273, "289": 274, "290": 275, "291": 276, "292": 277, "293": 278, "294": 279, "295": 280, "296": 281, "297": 282, "298": 283, "299": 284, "300": 285, "301": 286, "302": 287, "303": 288, "304": 289, "305": 290, "306": 291, "307": 292, "308": 293, "309": 294, "310": 295, "311": 296, "312": 297, "313": 298, "314": 299, "315": 300, "316": 301, "317": 302, "318": 303, "319": 304, "320": 305, "321": 306, "322": 307, "323": 308, "325": 309, "326": 310, "327": 311, "328": 312, "329": 313, "330": 314, "331": 315, "332": 316, "333": 317, "334": 318, "335": 319, "336": 320, "337": 321, "338": 322, "339": 323, "340": 324, "341": 325, "342": 326, "343": 327, "344": 328, "345": 329, "347": 330, "348": 331, "349": 332, "350": 333, "351": 334, "352": 335, "353": 336, "354": 337, "356": 338, "357": 339, "358": 340, "359": 341, "360": 342, "361": 343, "362": 344, "363": 345, "364": 346, "365": 347, "367": 348, "368": 349, "369": 350, "370": 351, "371": 352, "372": 353, "373": 354, "374": 355, "375": 356, "376": 357, "377": 358, "378": 359, "379": 360, "380": 361, "381": 362, "382": 363, "383": 364, "385": 365, "386": 366, "387": 367, "388": 368, "390": 369, "391": 370, "392": 371, "393": 372, "394": 373, "395": 374, "396": 375, "397": 376, "398": 377, "399": 378, "400": 379, "401": 380, "402": 381, "403": 382, "405": 383, "406": 384, "407": 385, "408": 386, "409": 387, "410": 388, "411": 389, "412": 390, "413": 391, "414": 392, "415": 393, "416": 394, "417": 395, "419": 396, "420": 397, "421": 398, "422": 399, "423": 400, "424": 401, "425": 402, "426": 403, "427": 404, "429": 405, "430": 406, "431": 407, "432": 408, "433": 409, "434": 410, "435": 411, "436": 412, "437": 413, "438": 414, "439": 415, "440": 416, "441": 417, "442": 418, "443": 419, "444": 420, "445": 421, "446": 422, "447": 423, "448": 424, "449": 425, "450": 426, "451": 427, "452": 428, "454": 429, "455": 430, "456": 431, "457": 432, "458": 433, "459": 434, "460": 435, "461": 436, "462": 437, "463": 438, "464": 439, "465": 440, "466": 441, "467": 442, "468": 443, "469": 444, "470": 445, "471": 446, "472": 447, "473": 448, "474": 449, "475": 450, "476": 451, "477": 452, "478": 453, "479": 454, "480": 455, "481": 456, "482": 457, "483": 458, "484": 459, "485": 460, "487": 461, "488": 462, "489": 463, "491": 464, "492": 465, "493": 466, "494": 467, "495": 468, "496": 469, "497": 470, "498": 471, "499": 472, "500": 473, "501": 474, "502": 475, "503": 476, "504": 477, "506": 478, "507": 479, "508": 480, "509": 481, "510": 482, "511": 483, "512": 484, "513": 485, "514": 486, "516": 487, "517": 488, "518": 489, "519": 490, "520": 491, "521": 492, "522": 493, "523": 494, "524": 495, "525": 496, "526": 497, "527": 498, "528": 499, "529": 500, "530": 501, "531": 502, "532": 503, "533": 504, "534": 505, "535": 506, "536": 507, "537": 508, "539": 509, "540": 510, "541": 511, "542": 512, "543": 513, "544": 514, "546": 515, "547": 516, "548": 517, "549": 518, "550": 519, "551": 520, "552": 521, "553": 522, "554": 523, "555": 524, "556": 525, "557": 526, "558": 527, "559": 528, "560": 529, "562": 530, "563": 531, "564": 532, "565": 533, "567": 534, "568": 535, "569": 536, "570": 537, "571": 538, "572": 539, "573": 540, "574": 541, "575": 542, "576": 543, "577": 544, "578": 545, "579": 546, "580": 547, "581": 548, "582": 549, "583": 550, "584": 551, "585": 552, "586": 553, "587": 554, "588": 555, "589": 556, "590": 557, "591": 558, "592": 559, "593": 560, "595": 561, "597": 562, "598": 563, "599": 564, "600": 565, "601": 566, "602": 567, "603": 568, "604": 569, "605": 570, "607": 571, "608": 572, "609": 573, "610": 574, "611": 575, "612": 576, "613": 577, "614": 578, "615": 579, "616": 580, "617": 581, "618": 582, "619": 583, "620": 584, "621": 585, "622": 586, "623": 587, "624": 588, "625": 589, "626": 590, "627": 591, "628": 592, "629": 593, "631": 594, "632": 595, "633": 596, "634": 597, "635": 598, "636": 599, "637": 600, "638": 601, "639": 602, "640": 603, "641": 604, "642": 605, "643": 606, "644": 607, "645": 608, "646": 609, "647": 610, "648": 611, "649": 612, "650": 613, "651": 614, "652": 615, "653": 616, "654": 617, "655": 618, "656": 619, "657": 620, "658": 621, "659": 622, "660": 623, "661": 624, "662": 625, "663": 626, "664": 627, "665": 628, "666": 629, "667": 630, "668": 631, "669": 632, "670": 633, "671": 634, "672": 635, "673": 636, "674": 637, "675": 638, "676": 639, "677": 640, "678": 641, "679": 642, "680": 643, "681": 644, "682": 645, "683": 646, "685": 647, "686": 648, "687": 649, "688": 650, "689": 651, "690": 652, "691": 653, "692": 654, "693": 655, "694": 656, "695": 657, "696": 658, "697": 659, "698": 660, "700": 661, "701": 662, "702": 663, "704": 664, "705": 665, "706": 666, "707": 667, "708": 668, "709": 669, "711": 670, "712": 671, "713": 672, "714": 673, "715": 674, "716": 675, "717": 676, "718": 677, "719": 678, "720": 679, "721": 680, "722": 681, "723": 682, "724": 683, "725": 684, "726": 685, "727": 686, "728": 687, "729": 688, "730": 689, "731": 690, "732": 691, "733": 692, "734": 693, "735": 694, "736": 695, "737": 696, "738": 697, "739": 698, "740": 699, "741": 700, "742": 701, "743": 702, "744": 703, "745": 704, "746": 705, "747": 706, "749": 707, "750": 708, "751": 709, "752": 710, "753": 711, "754": 712, "755": 713, "757": 714, "758": 715, "759": 716, "760": 717, "761": 718, "762": 719, "763": 720, "765": 721, "766": 722, "767": 723, "768": 724, "769": 725, "770": 726, "771": 727, "772": 728, "773": 729, "774": 730, "775": 731, "776": 732, "777": 733, "778": 734, "779": 735, "780": 736, "781": 737, "782": 738, "783": 739, "785": 740, "786": 741, "787": 742, "788": 743, "789": 744, "790": 745, "791": 746, "792": 747, "793": 748, "794": 749, "795": 750, "796": 751, "797": 752, "798": 753, "799": 754, "800": 755, "801": 756, "802": 757, "803": 758, "805": 759, "806": 760, "807": 761, "808": 762, "809": 763, "810": 764, "811": 765, "812": 766, "813": 767, "814": 768, "816": 769, "817": 770, "818": 771, "819": 772, "820": 773, "822": 774, "824": 775, "825": 776, "826": 777, "827": 778, "828": 779, "829": 780, "830": 781, "831": 782, "833": 783, "834": 784, "835": 785, "836": 786, "837": 787, "839": 788, "840": 789, "841": 790, "842": 791, "843": 792, "844": 793, "845": 794, "846": 795, "847": 796, "848": 797, "849": 798, "851": 799, "852": 800, "853": 801, "854": 802, "855": 803, "856": 804, "857": 805, "858": 806, "859": 807, "860": 808, "861": 809, "862": 810, "863": 811, "864": 812, "865": 813, "866": 814, "867": 815, "868": 816, "869": 817, "870": 818, "871": 819, "872": 820, "873": 821, "874": 822, "875": 823, "876": 824, "877": 825, "878": 826, "879": 827, "880": 828, "881": 829, "882": 830, "884": 831, "885": 832, "886": 833, "887": 834, "888": 835, "889": 836, "890": 837, "891": 838, "892": 839, "893": 840, "894": 841, "895": 842, "896": 843, "897": 844, "898": 845, "899": 846, "900": 847, "901": 848, "902": 849, "903": 850, "904": 851, "905": 852, "906": 853, "908": 854, "909": 855, "910": 856, "911": 857, "912": 858, "913": 859, "914": 860, "915": 861, "917": 862, "918": 863, "919": 864, "920": 865, "922": 866, "923": 867, "924": 868, "925": 869, "926": 870, "927": 871, "928": 872, "930": 873, "932": 874, "933": 875, "934": 876, "935": 877, "936": 878, "937": 879, "938": 880, "939": 881, "940": 882, "941": 883, "943": 884, "944": 885, "945": 886, "946": 887, "947": 888, "948": 889, "949": 890, "950": 891, "951": 892, "952": 893, "953": 894, "954": 895, "955": 896, "956": 897, "957": 898, "958": 899, "959": 900, "960": 901, "961": 902, "962": 903, "963": 904, "964": 905, "965": 906, "966": 907, "967": 908, "969": 909, "970": 910, "971": 911, "972": 912, "973": 913, "974": 914, "975": 915, "976": 916, "978": 917, "979": 918, "980": 919, "981": 920, "982": 921, "983": 922, "984": 923, "986": 924, "987": 925, "988": 926, "989": 927, "990": 928, "991": 929, "992": 930, "993": 931, "994": 932, "995": 933, "996": 934, "997": 935, "998": 936, "999": 937}